ResetOverwrites
Syntax
SapObject.SapModel.DesignSteel.ResetOverwrites
VB6 Procedure
Function ResetOverwrites() As Long
Parameters
None
Remarks
This function resets all steel frame design overwrites to default values.
The function returns zero if the overwrites are successfully reset; otherwise it returns a nonzero value.
The function will fail if no steel frame objects are present.
VBA Example
Sub ResetSteelDesignOverwrites()
 'dimension variables
 Dim SapObject as cOAPI
 Dim SapModel As cSapModel
 Dim ret As Long
 'create Sap2000 object
 Set SapObject = CreateObject("CSI.SAP2000.API.SapObject")
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'create model from template
 ret = SapModel.File.New2DFrame(PortalFrame, 2, 144, 2, 288)
 'reset steel design overwrites
 ret = SapModel.DesignSteel.ResetOverwrites
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in version 11.03.
See Also